modules/web/controllers/UserController.php

SELECT * FROM `user` WHERE `login_name`='54php.cn'
---
    public function actionLogin(){
        //如果是get请求，直接展示登陆页面
        if(\yii::$app->request->isGet){
            $this->layout = false;
            return $this->render("login");
        }
        //登录逻辑处理
        $login_name = trim( $this->post("login_name","") );
        $login_pwd = trim( $this->post("login_pwd","") );
        if( !$login_name || !$login_pwd){
            return $this->renderJs( '请输入正确的用户名和密码-1~~', UrlService::buildWebUrl("/user/login") );

        }

        //从 用户表 获取 login_name $login_name 信息是否存在
        $user_info = User::find()->where( ['login_name'=>$login_name] )->one();